In [13]:
import pandas as pd

workdir = 'C:\\Users\\ed.deane\\Python\\AdventOfCode\\Day 2 Rock Paper Scissors\\'

df= pd.read_csv(workdir+'input.txt', sep=' ',header=None, names=['elf','me'])

In [14]:
def calc_total(elf,me):
    #1 for Rock, 2 for Paper, and 3 for Scissors
    if me == 'X':
        me_val = 1
    elif me == 'Y':
        me_val = 2
    else:
        me_val = 3
        
    
    return me_val+calc_winner(elf,me)

def calc_winner(elf,me):
    if (me == 'X' and elf == 'A') or (me == 'Y' and elf == 'B') or (me == 'Z' and elf == 'C'):
        return 3
    #rock vs paper or scissors vs rock = lose    
    elif (me == 'X' and elf == 'B') or (me == 'Z' and elf == 'A') :
        return 0
    else:
        return 6

df['total']=df.apply(lambda row: calc_total(row['elf'],row['me']), axis=1)

In [15]:
df['total'].sum()
#elf scores 15193, 13808

13808

In [16]:
df

     elf me  total
0      B  X      1
1      A  Z      3
2      A  Y      8
3      B  X      1
4      C  Z      6
...   .. ..    ...
2495   C  Y      8
2496   B  Y      5
2497   C  Y      8
2498   C  Y      8
2499   B  Y      5

[2500 rows x 3 columns]